export interface CardTask {
  buttonTitle: string;
  imageSrc: string;
  imageAlt: string;
  informationTitle:string;
  informationArticles: string[];
}

export const cardTask: CardTask[] = [
  {
    buttonTitle: 'Создание репозитория-портфолио',
    imageSrc: '../assets/git.png',
    imageAlt: 'Git technology',
    informationTitle: 'Введение в технологию git',
    informationArticles: [
      ' Git - это консольная утилита, для отслеживания и ведения истории изменения файлов, в вашем проекте. Чаще всего его используют для кода, но можно и для других файлов. Например, для картинок - полезно для дизайнеров.\n' +
      '\n' +
      '            С помощью Git-a вы можете откатить свой проект до более старой версии, сравнивать, анализировать или сливать свои изменения в репозиторий.\n' +
      '\n' +
      '            Репозиторием называют хранилище вашего кода и историю его изменений. Git работает локально и все ваши репозитории хранятся в определенных папках на жестком диске.\n' +
      '\n' +
      '            Так же ваши репозитории можно хранить и в интернете. Обычно для этого используют три сервиса:\n' +
      '\n' +
      '            GitHub\n' +
      '\n' +
      '            Bitbucket\n' +
      '\n' +
      '            GitLab\n' +
      '\n' +
      '            Каждая точка сохранения вашего проекта носит название коммит (commit). У каждого commit-a есть hash (уникальный id) и комментарий. Из таких commit-ов собирается ветка. Ветка - это история изменений. У каждой ветки есть свое название. Репозиторий может содержать в себе несколько веток, которые создаются из других веток или вливаются в них.\n' +
      '        '
    ]
  }
]
